system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) //0
    (1 0 0) //1
    (9 0 0) //2
    (10 0 0) //3
    (10 6 0) //4
    (9 6 0) //5
    (1 6 0) //6
    (0 6 0) //7

    (0 0 10)
    (1 0 10)
    (9 0 10)
    (10 0 10)
    (10 6 10)
    (9 6 10)
    (1 6 10)
    (0 6 10)
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (5 30 60) simpleGrading (1 1 1)
    hex (1 2 5 6 9 10 13 14) (40 30 60) simpleGrading (1 1 1)
    hex (2 3 4 5 10 11 12 13)(5 30 60) simpleGrading (1 1 1)
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 1 9 8)
	    (1 2 10 9)
	    (2 3 11 10)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (6 5 13 14)
        );
    }
    sideWalls
    {
        type wall;
        faces
        (
            (0 8 15 7)
            (3 11 12 4)
            (0 1 6 7)
            (1 2 5 6)
	    (2 3 4 5)
	    (8 9 14 15)
	    (9 10 13 14)
	    (10 11 12 13)
        );
    }

    inlet
    {
	type patch;
	faces
	(
	    (7 6 14 15)
	);
    }

    outlet
    {
	type patch;
	faces
	(
	    (5 4 12 13)
	);
    }
);


// ******************************caesar_wiratama*************************** //