0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    human
    {
        type            noSlip;
    }
    floor
    {
        type            noSlip;
    }

    ceiling
    {
        type            noSlip;
    }

    sideWalls
    {
        type            noSlip;
    }

    inlet
    {
	type		fixedValue;
	value		uniform (0 -0.2 0);
    }

    outlet
    {
	//type		zeroGradient;
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}

// ******************************caesar_wiratama*************************** //