0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    human
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    floor
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    ceiling
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    sideWalls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    inlet
    {
	type		zeroGradient; //fixedFluxPressure;
	//value		$internalField;
    }

    outlet
    {
	type		fixedValue;
	value		$internalField;
    }

}

// ******************************caesar_wiratama*************************** //