0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    human
    {
        type            fixedValue;
        value           uniform 310;
    }
    floor
    {
        type            fixedValue;
        value           uniform 300;
    }

    ceiling
    {
        type            fixedValue;
        value           uniform 300;
    }

    sideWalls
    {
        type            fixedValue;
	value		uniform 300;
    }

    inlet
    {
	type		fixedValue;
	value		uniform 295;
    }

    outlet
    {
	type		zeroGradient;
    }
}

// ******************************caesar_wiratama*************************** //