0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    human
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    floor
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    ceiling
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    sideWalls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    inlet
    {
	type		fixedValue;
	value		$internalField;
    }

    outlet
    {
	type		fixedValue;
	value		$internalField;
    }
}


// ******************************caesar_wiratama*************************** //